app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."publish" = $1  [["publish", "t"]]
---
  def index
    @items = Item.where(publish: true)

INSERT INTO "items" ("name", "description", "oldprice", "newprice", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "<sdv"], ["description", "<sdv"], ["oldprice", "<dsv"], ["newprice", "<dv"], ["created_at", "2017-07-04 10:29:09.044606"], ["updated_at", "2017-07-04 10:29:09.044606"]]
---
  def create
    @item = Item.create(item_params).save

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "0"], ["updated_at", "2017-07-04 11:19:41.166715"], ["id", 8]]
---
  def update
    @item = Item.find(params[:id])
    @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def order
    @item = Item.find(params[:itemId])